def task_one():
    print("Напишите функцию, которая принимает на вход строку — абсолютный путь до файла.\n"
          "Функция возвращает кортеж из трёх элементов: путь, имя файла, расширение файла.")


def task_two():
    print("Напишите однострочный генератор словаря, который принимает на вход три списка одинаковой длины:"
          "имена str, ставка int, премия str с указанием процентов вида «10.25%»."
          "В результате получаем словарь с именем в качестве ключа и суммой премии в качестве значения."
          "Сумма рассчитывается как ставка умноженная на процент премии.")

def task_three():
    print("Создайте функцию генератор чисел Фибоначчи (см. Википедию).")
