def task_one():
    print('1. Дан список повторяющихся элементов. Вернуть список с дублирующимися элементами. '
      'В результирующем списке не должно быть дубликатов.')


def duplicate_list():
    print('Duplicate elements: ', end='')


def uniq_list():
    print('Unique elements: ', end='')


def task_two():
    print('2. В большой текстовой строке подсчитать количество встречаемых слов и вернуть 10 самых частых. '
          'Не учитывать знаки препинания и регистр символов. '
          'За основу возьмите любую статью из википедии или из документации к языку.')


def most_common():
    print('10 most common words are: ')


def task_three():
    print('3. Создайте словарь со списком вещей для похода в качестве ключа и их массой в качестве значения. '
          'Определите какие вещи влезут в рюкзак передав его максимальную грузоподъёмность. '
          'Достаточно вернуть один допустимый вариант. \n*Верните все возможные варианты комплектации рюкзака.')
