def task_one():
    print(
        'Напишите программу, которая получает целое число и возвращает его шестнадцатеричное строковое представление.\n'
        'Функцию hex используйте для проверки своего результата.')


def task_one_welcome_message():
    print('Please enter a number to convert to hexadecimal: ')


def task_one_warning_message():
    print('Only integers are allowed, please check your input and try again: ')


def multiply_message():
    print('Product of fractions: ', end='')


def sum_message():
    print('The sum of fractions: ', end='')


def built_in_fractions():
    print('Using built-in functions: ')


def task_two():
    print('Напишите программу, которая принимает две строки вида “user_number/b” - дробь с числителем и знаменателем.\n'
          'Программа должна возвращать сумму и произведение* дробей.\n'
          'Для проверки своего кода используйте модуль fractions.')


def task_two_welcome_message():
    print('Please enter two fraction: ')


def task_two_warning_message():
    print('Only fractions are allowed, please check your input and try again: ')


def conversion_confirmation():
    print('The result of the number conversion: ', end='')


def built_in_conversion():
    print('Conversion using the built-in function: ', end='')
