def task_animal_farm():
    print('Решить задачи, которые не успели решить на семинаре.'
          '\nДоработаем задачи 5-6. Создайте класс-фабрику.'
          '\n○ Класс принимает тип животного (название одного из созданных классов) и параметры для этого типа.'
          '\n○ Внутри класса создайте экземпляр на основе переданного типа и верните его из класса-фабрики.'
          '\nВозьмите 1-3 любые задачи из прошлых семинаров (например, сериализация данных), которые вы уже решали. '
          '\nПревратите функции в методы класса, а параметры в свойства. '
          '\nЗадачи должны решаться через вызов методов экземпляра.')
