def task_animal_farm():
    print('Создайте класс-фабрику.'
          '\n○ Класс принимает тип животного (название одного из созданных классов) и параметры для этого типа.'
          '\n○ Внутри класса создайте экземпляр на основе переданного типа и верните его из класса-фабрики.'
          '\nЗадачи должны решаться через вызов методов экземпляра.\n')
def task_cashier():
    print('Возьмите 1-3 любые задачи из прошлых семинаров (например, сериализация данных), которые вы уже решали. '
          '\n○ Превратите функции в методы класса, а параметры в свойства.'
          '\nЗадачи должны решаться через вызов методов экземпляра.\n')
    